jadjer/esp32-nimble/src/Client.cpp
// Copyright 2024 Pavel Suprunov
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include "sdkconfig.h"
#if defined(CONFIG_BT_NIMBLE_ENABLED) && defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)

#include "nimble/Client.hpp"
#include "nimble/Device.hpp"
#include "nimble/Log.hpp"

#include <string>
#include <unordered_set>
#include <climits>

#if defined(CONFIG_NIMBLE_CPP_IDF)
#include "nimble/nimble_port.h"
#else
#include "nimble/porting/nimble/include/nimble/nimble_port.h"
#endif

static const char* LOG_TAG = "NimBLEClient";
static NimBLEClientCallbacks defaultCallbacks;

/*
 * Design
 * ------
 * When we perform a getService() request, we are asking the BLE server to return each of the services
 * that it exposes.  For each service, we receive a callback which contains details
 * of the exposed service including its UUID.
 *
 * The objects we will invent for a NimBLEClient will be as follows:
 * * NimBLERemoteService - A model of a remote service.
 * * NimBLERemoteCharacteristic - A model of a remote characteristic
 * * NimBLERemoteDescriptor - A model of a remote descriptor.
 *
 * Since there is a hierarchical relationship here, we will have the idea that from a NimBLERemoteService will own
 * zero or more remote characteristics and a NimBLERemoteCharacteristic will own zero or more remote NimBLEDescriptors.
 *
 * We will assume that a NimBLERemoteService contains a vector of owned characteristics
 * and that a NimBLECharacteristic contains a vector of owned descriptors.
 *
 *
 */

namespace nimble {

/**
 * @brief Constructor, private - only callable by NimBLEDevice::createClient
 * to ensure proper handling of the list of client objects.
 */
Client::Client(const Address &peerAddress) : m_peerAddress(peerAddress) {
  m_pClientCallbacks = &defaultCallbacks;
  m_conn_id = BLE_HS_CONN_HANDLE_NONE;
  m_connectTimeout = 30000;
  m_deleteCallbacks = false;
  m_pTaskData = nullptr;
  m_connEstablished = false;
  m_lastErr = 0;
#if CONFIG_BT_NIMBLE_EXT_ADV
  m_phyMask = BLE_GAP_LE_PHY_1M_MASK | BLE_GAP_LE_PHY_2M_MASK | BLE_GAP_LE_PHY_CODED_MASK;
#endif

  m_pConnParams.scan_itvl = 16;                                           // Scan interval in 0.625ms units (NimBLE Default)
  m_pConnParams.scan_window = 16;                                         // Scan window in 0.625ms units (NimBLE Default)
  m_pConnParams.itvl_min = BLE_GAP_INITIAL_CONN_ITVL_MIN;                 // min_int = 0x10*1.25ms = 20ms
  m_pConnParams.itvl_max = BLE_GAP_INITIAL_CONN_ITVL_MAX;                 // max_int = 0x20*1.25ms = 40ms
  m_pConnParams.latency = BLE_GAP_INITIAL_CONN_LATENCY;                   // number of packets allowed to skip (extends max interval)
  m_pConnParams.supervision_timeout = BLE_GAP_INITIAL_SUPERVISION_TIMEOUT;// timeout = 400*10ms = 4000ms
  m_pConnParams.min_ce_len = BLE_GAP_INITIAL_CONN_MIN_CE_LEN;             // Minimum length of connection event in 0.625ms units
  m_pConnParams.max_ce_len = BLE_GAP_INITIAL_CONN_MAX_CE_LEN;             // Maximum length of connection event in 0.625ms units

  memset(&m_dcTimer, 0, sizeof(m_dcTimer));
  ble_npl_callout_init(&m_dcTimer, nimble_port_get_dflt_eventq(),
                       Client::dcTimerCb, this);
}// NimBLEClient

/**
 * @brief Destructor, private - only callable by NimBLEDevice::deleteClient
 * to ensure proper disconnect and removal from device list.
 */
Client::~Client() {
  // We may have allocated service references associated with this client.
  // Before we are finished with the client, we must release resources.
  deleteServices();

  if (m_deleteCallbacks && m_pClientCallbacks != &defaultCallbacks) {
    delete m_pClientCallbacks;
  }

  ble_npl_callout_deinit(&m_dcTimer);

}// ~NimBLEClient

/**
 * @brief If we have asked to disconnect and the event does not
 * occur within the supervision timeout + added delay, this will
 * be called to reset the host in the case of a stalled controller.
 */
void Client::dcTimerCb(ble_npl_event *event) {
  /*   NimBLEClient *pClient = (NimBLEClient*)event->arg;
    NIMBLE_LOGC(LOG_TAG, "Timed out disconnecting from %s - resetting host",
                std::string(pClient->getPeerAddress()).c_str());
 */
  ble_hs_sched_reset(BLE_HS_ECONTROLLER);
}

/**
 * @brief Delete all service objects created by this client and clear the vector.
 */
void Client::deleteServices() {
  NIMBLE_LOGD(LOG_TAG, ">> deleteServices");
  // Delete all the services.
  for (auto &it : m_servicesVector) {
    delete it;
  }
  m_servicesVector.clear();

  NIMBLE_LOGD(LOG_TAG, "<< deleteServices");
}// deleteServices

/**
 * @brief Delete service by UUID
 * @param [in] uuid The UUID of the service to be deleted from the local database.
 * @return Number of services left.
 */
size_t Client::deleteService(const UUID &uuid) {
  NIMBLE_LOGD(LOG_TAG, ">> deleteService");
  // Delete the requested service.
  for (auto it = m_servicesVector.begin(); it != m_servicesVector.end(); ++it) {
    if ((*it)->getUUID() == uuid) {
      delete *it;
      m_servicesVector.erase(it);
      break;
    }
  }

  NIMBLE_LOGD(LOG_TAG, "<< deleteService");

  return m_servicesVector.size();
}// deleteServices

/**
 * @brief Connect to the BLE Server.
 * @param [in] deleteAttributes If true this will delete any attribute objects this client may already\n
 * have created and clears the vectors after successful connection.
 * @return True on success.
 */
bool Client::connect(bool deleteAttributes) {
  return connect(m_peerAddress, deleteAttributes);
}

/**
 * @brief Connect to an advertising device.
 * @param [in] device The device to connect to.
 * @param [in] deleteAttributes If true this will delete any attribute objects this client may already\n
 * have created and clears the vectors after successful connection.
 * @return True on success.
 */
bool Client::connect(AdvertisedDevice *device, bool deleteAttributes) {
  Address address(device->getAddress());
  return connect(address, deleteAttributes);
}

/**
 * @brief Connect to the BLE Server.
 * @param [in] address The address of the server.
 * @param [in] deleteAttributes If true this will delete any attribute objects this client may already\n
 * have created and clears the vectors after successful connection.
 * @return True on success.
 */
bool Client::connect(const Address &address, bool deleteAttributes) {
  NIMBLE_LOGD(LOG_TAG, ">> connect(%s)", address.toString().c_str());

