jadjer/esp32-nimble/src/Client.cpp
  if (!Device::m_synced) {
    NIMBLE_LOGC(LOG_TAG, "Host reset, wait for sync.");
    return false;
  }

  if (isConnected() || m_connEstablished || m_pTaskData != nullptr) {
    NIMBLE_LOGE(LOG_TAG, "Client busy, connected to %s, id=%d",
                std::string(m_peerAddress).c_str(), getConnId());
    return false;
  }

  ble_addr_t peerAddr_t;
  memcpy(&peerAddr_t.val, address.getNative(), 6);
  peerAddr_t.type = address.getType();
  if (ble_gap_conn_find_by_addr(&peerAddr_t, nullptr) == 0) {
    NIMBLE_LOGE(LOG_TAG, "A connection to %s already exists",
                address.toString().c_str());
    return false;
  }

  if (address == Address("")) {
    NIMBLE_LOGE(LOG_TAG, "Invalid peer address;(NULL)");
    return false;
  } else {
    m_peerAddress = address;
  }

  TaskHandle_t cur_task = xTaskGetCurrentTaskHandle();
  ble_task_data_t taskData = {this, cur_task, 0, nullptr};
  m_pTaskData = &taskData;
  int rc = 0;

  /* Try to connect the the advertiser.  Allow 30 seconds (30000 ms) for
     *  timeout (default value of m_connectTimeout).
     *  Loop on BLE_HS_EBUSY if the scan hasn't stopped yet.
     */
  do {
#if CONFIG_BT_NIMBLE_EXT_ADV
    rc = ble_gap_ext_connect(NimBLEDevice::m_own_addr_type,
                             &peerAddr_t,
                             m_connectTimeout,
                             m_phyMask,
                             &m_pConnParams,
                             &m_pConnParams,
                             &m_pConnParams,
                             NimBLEClient::handleGapEvent,
                             this);

#else
    rc = ble_gap_connect(Device::m_own_addr_type, &peerAddr_t,
                         m_connectTimeout, &m_pConnParams,
                         Client::handleGapEvent, this);
#endif
    switch (rc) {
    case 0:
      break;

    case BLE_HS_EBUSY:
      // Scan was still running, stop it and try again
      if (!NimBLEDevice::getScan()->stop()) {
        rc = BLE_HS_EUNKNOWN;
      }
      break;

    case BLE_HS_EDONE:
      // A connection to this device already exists, do not connect twice.
      NIMBLE_LOGE(LOG_TAG, "Already connected to device; addr=%s",
                  std::string(m_peerAddress).c_str());
      break;

    case BLE_HS_EALREADY:
      // Already attempting to connect to this device, cancel the previous
      // attempt and report failure here so we don't get 2 connections.
      NIMBLE_LOGE(LOG_TAG, "Already attempting to connect to %s - cancelling",
                  std::string(m_peerAddress).c_str());
      ble_gap_conn_cancel();
      break;

    default:
      NIMBLE_LOGE(LOG_TAG, "Failed to connect to %s, rc=%d; %s",
                  std::string(m_peerAddress).c_str(),
                  rc, Utils::returnCodeToString(rc));
      break;
    }

  } while (rc == BLE_HS_EBUSY);

  m_lastErr = rc;

  if (rc != 0) {
    m_pTaskData = nullptr;
    return false;
  }

#ifdef ulTaskNotifyValueClear
  // Clear the task notification value to ensure we block
  ulTaskNotifyValueClear(cur_task, ULONG_MAX);
#endif
  // Wait for the connect timeout time +1 second for the connection to complete
  if (ulTaskNotifyTake(pdTRUE, pdMS_TO_TICKS(m_connectTimeout + 1000)) == pdFALSE) {
    m_pTaskData = nullptr;
    // If a connection was made but no response from MTU exchange; disconnect
    if (isConnected()) {
      NIMBLE_LOGE(LOG_TAG, "Connect timeout - no response");
      disconnect();
    } else {
      // workaround; if the controller doesn't cancel the connection
      // at the timeout, cancel it here.
      NIMBLE_LOGE(LOG_TAG, "Connect timeout - cancelling");
      ble_gap_conn_cancel();
    }

    return false;

  } else if (taskData.rc != 0) {
    m_lastErr = taskData.rc;
    NIMBLE_LOGE(LOG_TAG, "Connection failed; status=%d %s",
                taskData.rc,
                Utils::returnCodeToString(taskData.rc));
    // If the failure was not a result of a disconnection
    // make sure we disconnect now to avoid dangling connections
    if (isConnected()) {
      disconnect();
    }
    return false;
  } else {
    NIMBLE_LOGI(LOG_TAG, "Connection established");
  }

  if (deleteAttributes) {
    deleteServices();
  }

  m_connEstablished = true;
  m_pClientCallbacks->onConnect(this);

  NIMBLE_LOGD(LOG_TAG, "<< connect()");
  // Check if still connected before returning
  return isConnected();
}// connect

/**
 * @brief Initiate a secure connection (pair/bond) with the server.\n
 * Called automatically when a characteristic or descriptor requires encryption or authentication to access it.
 * @return True on success.
 */
bool Client::secureConnection() {
  NIMBLE_LOGD(LOG_TAG, ">> secureConnection()");
  TaskHandle_t cur_task = xTaskGetCurrentTaskHandle();
  ble_task_data_t taskData = {this, cur_task, 0, nullptr};

  int retryCount = 1;

  do {
    m_pTaskData = &taskData;

    int rc = Device::startSecurity(m_conn_id);
    if (rc != 0 && rc != BLE_HS_EALREADY) {
      m_lastErr = rc;
      m_pTaskData = nullptr;
      return false;
    }

#ifdef ulTaskNotifyValueClear
    // Clear the task notification value to ensure we block
    ulTaskNotifyValueClear(cur_task, ULONG_MAX);
#endif
    ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
  } while (taskData.rc == (BLE_HS_ERR_HCI_BASE + BLE_ERR_PINKEY_MISSING) && retryCount--);

  if (taskData.rc != 0) {
    m_lastErr = taskData.rc;
    NIMBLE_LOGE(LOG_TAG, "secureConnection: failed rc=%d", taskData.rc);
    return false;
  }

  NIMBLE_LOGD(LOG_TAG, "<< secureConnection: success");
  return true;
}// secureConnection

/**
 * @brief Disconnect from the peer.
 * @return Error code from NimBLE stack, 0 = success.
 */
int Client::disconnect(uint8_t reason) {
  NIMBLE_LOGD(LOG_TAG, ">> disconnect()");
  int rc = 0;
  if (isConnected()) {
    // If the timer was already started, ignore this call.
    if (ble_npl_callout_is_active(&m_dcTimer)) {
      NIMBLE_LOGI(LOG_TAG, "Already disconnecting, timer started");
      return BLE_HS_EALREADY;
    }

    ble_gap_conn_desc desc;
    if (ble_gap_conn_find(m_conn_id, &desc) != 0) {
      NIMBLE_LOGI(LOG_TAG, "Connection ID not found");
      return BLE_HS_EALREADY;
    }

    // We use a timer to detect a controller error in the event that it does
    // not inform the stack when disconnection is complete.
    // This is a common error in certain esp-idf versions.
    // The disconnect timeout time is the supervision timeout time + 1 second.
    // In the case that the event happens shortly after the supervision timeout
    // we don't want to prematurely reset the host.
    ble_npl_time_t ticks;
    ble_npl_time_ms_to_ticks((desc.supervision_timeout + 100) * 10, &ticks);
    ble_npl_callout_reset(&m_dcTimer, ticks);

    rc = ble_gap_terminate(m_conn_id, reason);
    if (rc != 0) {
      if (rc != BLE_HS_EALREADY) {
        ble_npl_callout_stop(&m_dcTimer);
      }
      NIMBLE_LOGE(LOG_TAG, "ble_gap_terminate failed: rc=%d %s",
                  rc, Utils::returnCodeToString(rc));
    }
  } else {
    NIMBLE_LOGD(LOG_TAG, "Not connected to any peers");
  }

  NIMBLE_LOGD(LOG_TAG, "<< disconnect()");
  m_lastErr = rc;
  return rc;
}// disconnect

