jadjer/esp32-nimble/src/Client.cpp
#if CONFIG_BT_NIMBLE_EXT_ADV
/**
 * @brief Set the PHY types to use when connecting to a server.
 * @param [in] mask A bitmask indicating what PHYS to connect with.\n
 * The available bits are:
 * * 0x01 BLE_GAP_LE_PHY_1M_MASK
 * * 0x02 BLE_GAP_LE_PHY_2M_MASK
 * * 0x04 BLE_GAP_LE_PHY_CODED_MASK
 */
void NimBLEClient::setConnectPhy(uint8_t mask) {
  m_phyMask = mask;
}
#endif

/**
 * @brief Set the connection parameters to use when connecting to a server.
 * @param [in] minInterval The minimum connection interval in 1.25ms units.
 * @param [in] maxInterval The maximum connection interval in 1.25ms units.
 * @param [in] latency The number of packets allowed to skip (extends max interval).
 * @param [in] timeout The timeout time in 10ms units before disconnecting.
 * @param [in] scanInterval The scan interval to use when attempting to connect in 0.625ms units.
 * @param [in] scanWindow The scan window to use when attempting to connect in 0.625ms units.
 */
void Client::setConnectionParams(uint16_t minInterval, uint16_t maxInterval,
                                 uint16_t latency, uint16_t timeout,
                                 uint16_t scanInterval, uint16_t scanWindow) /*,
                                uint16_t minConnTime, uint16_t maxConnTime)*/
{

  m_pConnParams.scan_itvl = scanInterval;
  m_pConnParams.scan_window = scanWindow;
  m_pConnParams.itvl_min = minInterval;
  m_pConnParams.itvl_max = maxInterval;
  m_pConnParams.latency = latency;
  m_pConnParams.supervision_timeout = timeout;

  // These are not used by NimBLE at this time - Must leave at defaults
  //m_pConnParams->min_ce_len = minConnTime;     // Minimum length of connection event in 0.625ms units
  //m_pConnParams->max_ce_len = maxConnTime;     // Maximum length of connection event in 0.625ms units

  int rc = Utils::checkConnParams(&m_pConnParams);
  assert(rc == 0 && "Invalid Connection parameters");
}// setConnectionParams

/**
 * @brief Update the connection parameters:
 * * Can only be used after a connection has been established.
 * @param [in] minInterval The minimum connection interval in 1.25ms units.
 * @param [in] maxInterval The maximum connection interval in 1.25ms units.
 * @param [in] latency The number of packets allowed to skip (extends max interval).
 * @param [in] timeout The timeout time in 10ms units before disconnecting.
 */
void Client::updateConnParams(uint16_t minInterval, uint16_t maxInterval,
                              uint16_t latency, uint16_t timeout) {
  ble_gap_upd_params params;

  params.latency = latency;
  params.itvl_max = maxInterval;
  params.itvl_min = minInterval;
  params.supervision_timeout = timeout;
  // These are not used by NimBLE at this time - Must leave at defaults
  params.min_ce_len = BLE_GAP_INITIAL_CONN_MIN_CE_LEN;
  params.max_ce_len = BLE_GAP_INITIAL_CONN_MAX_CE_LEN;

  int rc = ble_gap_update_params(m_conn_id, &params);
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "Update params error: %d, %s",
                rc, Utils::returnCodeToString(rc));
  }
}// updateConnParams

/**
 * @brief Request an update of the data packet length.
 * * Can only be used after a connection has been established.
 * @details Sends a data length update request to the server the client is connected to.
 * The Data Length Extension (DLE) allows to increase the Data Channel Payload from 27 bytes to up to 251 bytes.
 * The server needs to support the Bluetooth 4.2 specifications, to be capable of DLE.
 * @param [in] tx_octets The preferred number of payload octets to use (Range 0x001B-0x00FB).
 */
void Client::setDataLen(uint16_t tx_octets) {
#if defined(CONFIG_NIMBLE_CPP_IDF) && !defined(ESP_IDF_VERSION) || (ESP_IDF_VERSION_MAJOR * 100 + ESP_IDF_VERSION_MINOR * 10 + ESP_IDF_VERSION_PATCH) < 432
  return;
#else
  uint16_t tx_time = (tx_octets + 14) * 8;

  int rc = ble_gap_set_data_len(m_conn_id, tx_octets, tx_time);
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "Set data length error: %d, %s", rc, Utils::returnCodeToString(rc));
  }
#endif
}// setDataLen

/**
 * @brief Get detailed information about the current peer connection.
 */
ConnectionInfo Client::getConnInfo() {
  ConnectionInfo connInfo;
  if (!isConnected()) {
    NIMBLE_LOGE(LOG_TAG, "Not connected");
  } else {
    int rc = ble_gap_conn_find(m_conn_id, &connInfo.m_desc);
    if (rc != 0) {
      NIMBLE_LOGE(LOG_TAG, "Connection info not found");
    }
  }

  return connInfo;
}// getConnInfo

/**
 * @brief Set the timeout to wait for connection attempt to complete.
 * @param [in] time The number of milliseconds before timeout.
 */
void Client::setConnectTimeout(uint32_t time) {
  m_connectTimeout = time;
}// setConnectTimeout

/**
 * @brief Get the connection id for this client.
 * @return The connection id.
 */
uint16_t Client::getConnId() {
  return m_conn_id;
}// getConnId

/**
 * @brief Retrieve the address of the peer.
 */
Address Client::getPeerAddress() {
  return m_peerAddress;
}// getPeerAddress

/**
 * @brief Set the peer address.
 * @param [in] address The address of the peer that this client is
 * connected or should connect to.
 */
void Client::setPeerAddress(const Address &address) {
  if (isConnected()) {
    NIMBLE_LOGE(LOG_TAG, "Cannot set peer address while connected");
    return;
  }

  m_peerAddress = address;
  NIMBLE_LOGD(LOG_TAG, "Peer address set: %s", std::string(m_peerAddress).c_str());
}// setPeerAddress

/**
 * @brief Ask the BLE server for the RSSI value.
 * @return The RSSI value.
 */
int Client::getRssi() {
  NIMBLE_LOGD(LOG_TAG, ">> getRssi()");
  if (!isConnected()) {
    NIMBLE_LOGE(LOG_TAG, "<< getRssi(): Not connected");
    return 0;
  }

  int8_t rssiValue = 0;
  int rc = ble_gap_conn_rssi(m_conn_id, &rssiValue);
  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "Failed to read RSSI error code: %d, %s",rc, Utils::returnCodeToString(rc));
    m_lastErr = rc;
    return 0;
  }

  return rssiValue;
}// getRssi

/**
 * @brief Get iterator to the beginning of the vector of remote service pointers.
 * @return An iterator to the beginning of the vector of remote service pointers.
 */
std::vector<RemoteService *>::iterator Client::begin() {
  return m_servicesVector.begin();
}

/**
 * @brief Get iterator to the end of the vector of remote service pointers.
 * @return An iterator to the end of the vector of remote service pointers.
 */
std::vector<RemoteService *>::iterator Client::end() {
  return m_servicesVector.end();
}

/**
 * @brief Get the service BLE Remote Service instance corresponding to the uuid.
 * @param [in] uuid The UUID of the service being sought.
 * @return A pointer to the service or nullptr if not found.
 */
RemoteService *Client::getService(const char *uuid) {
  return getService(UUID(uuid));
}// getService

/**
 * @brief Get the service object corresponding to the uuid.
 * @param [in] uuid The UUID of the service being sought.
 * @return A pointer to the service or nullptr if not found.
 */
RemoteService *Client::getService(const UUID &uuid) {
  NIMBLE_LOGD(LOG_TAG, ">> getService: uuid: %s", uuid.toString().c_str());

  for (auto &it : m_servicesVector) {
    if (it->getUUID() == uuid) {
      NIMBLE_LOGD(LOG_TAG, "<< getService: found the service with uuid: %s", uuid.toString().c_str());
      return it;
    }
  }

  size_t prev_size = m_servicesVector.size();
  if (retrieveServices(&uuid)) {
    if (m_servicesVector.size() > prev_size) {
      return m_servicesVector.back();
    }

    // If the request was successful but 16/32 bit uuid not found
    // try again with the 128 bit uuid.
    if (uuid.bitSize() == BLE_UUID_TYPE_16 || uuid.bitSize() == BLE_UUID_TYPE_32) {
      UUID uuid128(uuid);
      uuid128.to128();
      if (retrieveServices(&uuid128)) {
        if (m_servicesVector.size() > prev_size) {
          return m_servicesVector.back();
        }
      }
    } else {
      // If the request was successful but the 128 bit uuid not found
      // try again with the 16 bit uuid.
      UUID uuid16(uuid);
      uuid16.to16();
      // if the uuid was 128 bit but not of the BLE base type this check will fail
      if (uuid16.bitSize() == BLE_UUID_TYPE_16) {
        if (retrieveServices(&uuid16)) {
          if (m_servicesVector.size() > prev_size) {
            return m_servicesVector.back();
          }
        }
      }
    }
  }

