jadjer/esp32-nimble/src/Client.cpp
  NIMBLE_LOGD(LOG_TAG, "<< getService: not found");
  return nullptr;
}// getService

/**
 * @brief Get a pointer to the vector of found services.
 * @param [in] refresh If true the current services vector will be cleared and\n
 * all services will be retrieved from the peripheral.\n
 * If false the vector will be returned with the currently stored services.
 * @return A pointer to the vector of available services.
 */
std::vector<RemoteService *> *Client::getServices(bool refresh) {
  if (refresh) {
    deleteServices();

    if (!retrieveServices()) {
      NIMBLE_LOGE(LOG_TAG, "Error: Failed to get services");
    } else {
      NIMBLE_LOGI(LOG_TAG, "Found %d services", m_servicesVector.size());
    }
  }
  return &m_servicesVector;
}// getServices

/**
 * @brief Retrieves the full database of attributes that the peripheral has available.
 * @return True if successful.
 */
bool Client::discoverAttributes() {
  deleteServices();

  if (!retrieveServices()) {
    return false;
  }

  for (auto svc : m_servicesVector) {
    if (!svc->retrieveCharacteristics()) {
      return false;
    }

    for (auto chr : svc->m_characteristicVector) {
      if (!chr->retrieveDescriptors()) {
        return false;
      }
    }
  }

  return true;
}// discoverAttributes

/**
 * @brief Ask the remote %BLE server for its services.\n
 * Here we ask the server for its set of services and wait until we have received them all.
 * @return true on success otherwise false if an error occurred
 */
bool Client::retrieveServices(const UUID *uuid_filter) {
  /**
 * Design
 * ------
 * We invoke ble_gattc_disc_all_svcs.  This will request a list of the services exposed by the
 * peer BLE partner to be returned in the callback function provided.
 */

  NIMBLE_LOGD(LOG_TAG, ">> retrieveServices");

  if (!isConnected()) {
    NIMBLE_LOGE(LOG_TAG, "Disconnected, could not retrieve services -aborting");
    return false;
  }

  int rc = 0;
  TaskHandle_t cur_task = xTaskGetCurrentTaskHandle();
  ble_task_data_t taskData = {this, cur_task, 0, nullptr};

  if (uuid_filter == nullptr) {
    rc = ble_gattc_disc_all_svcs(m_conn_id, Client::serviceDiscoveredCB, &taskData);
  } else {
    rc = ble_gattc_disc_svc_by_uuid(m_conn_id, &uuid_filter->getNative()->u,
                                    Client::serviceDiscoveredCB, &taskData);
  }

  if (rc != 0) {
    NIMBLE_LOGE(LOG_TAG, "ble_gattc_disc_all_svcs: rc=%d %s", rc, Utils::returnCodeToString(rc));
    m_lastErr = rc;
    return false;
  }

#ifdef ulTaskNotifyValueClear
  // Clear the task notification value to ensure we block
  ulTaskNotifyValueClear(cur_task, ULONG_MAX);
#endif

  // wait until we have all the services
  ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
  m_lastErr = taskData.rc;

  if (taskData.rc == 0) {
    NIMBLE_LOGD(LOG_TAG, "<< retrieveServices");
    return true;
  } else {
    NIMBLE_LOGE(LOG_TAG, "Could not retrieve services");
    return false;
  }
}// getServices

/**
 * @brief STATIC Callback for the service discovery API function.\n
 * When a service is found or there is none left or there was an error
 * the API will call this and report findings.
 */
int Client::serviceDiscoveredCB(
    uint16_t conn_handle,
    const struct ble_gatt_error *error,
    const struct ble_gatt_svc *service, void *arg) {
  NIMBLE_LOGD(LOG_TAG, "Service Discovered >> status: %d handle: %d",
              error->status, (error->status == 0) ? service->start_handle : -1);

  ble_task_data_t *pTaskData = (ble_task_data_t *) arg;
  Client *client = (Client *) pTaskData->pATT;

  // Make sure the service discovery is for this device
  if (client->getConnId() != conn_handle) {
    return 0;
  }

  if (error->status == 0) {
    // Found a service - add it to the vector
    RemoteService *pRemoteService = new RemoteService(client, service);
    client->m_servicesVector.push_back(pRemoteService);
    return 0;
  }

  if (error->status == BLE_HS_EDONE) {
    pTaskData->rc = 0;
  } else {
    NIMBLE_LOGE(LOG_TAG, "serviceDiscoveredCB() rc=%d %s",error->status, Utils::returnCodeToString(error->status));
    pTaskData->rc = error->status;
  }

  xTaskNotifyGive(pTaskData->task);

  NIMBLE_LOGD(LOG_TAG, "<< Service Discovered");
  return error->status;
}

/**
 * @brief Get the value of a specific characteristic associated with a specific service.
 * @param [in] serviceUUID The service that owns the characteristic.
 * @param [in] characteristicUUID The characteristic whose value we wish to read.
 * @returns characteristic value or an empty string if not found
 */
AttributeValue Client::getValue(const UUID &serviceUUID, const UUID &characteristicUUID) {
  NIMBLE_LOGD(LOG_TAG, ">> getValue: serviceUUID: %s, characteristicUUID: %s", serviceUUID.toString().c_str(), characteristicUUID.toString().c_str());

  AttributeValue ret;
  RemoteService *pService = getService(serviceUUID);

  if (pService != nullptr) {
    RemoteCharacteristic *pChar = pService->getCharacteristic(characteristicUUID);
    if (pChar != nullptr) {
      ret = pChar->readValue();
    }
  }

  NIMBLE_LOGD(LOG_TAG, "<< getValue");
  return ret;
}// getValue

/**
 * @brief Set the value of a specific characteristic associated with a specific service.
 * @param [in] serviceUUID The service that owns the characteristic.
 * @param [in] characteristicUUID The characteristic whose value we wish to write.
 * @param [in] value The value to write to the characteristic.
 * @param [in] response If true, uses write with response operation.
 * @returns true if successful otherwise false
 */
bool Client::setValue(const UUID &serviceUUID, const UUID &characteristicUUID,
                      const AttributeValue &value, bool response) {
  NIMBLE_LOGD(LOG_TAG, ">> setValue: serviceUUID: %s, characteristicUUID: %s", serviceUUID.toString().c_str(), characteristicUUID.toString().c_str());

  bool ret = false;
  RemoteService *pService = getService(serviceUUID);

  if (pService != nullptr) {
    RemoteCharacteristic *pChar = pService->getCharacteristic(characteristicUUID);
    if (pChar != nullptr) {
      ret = pChar->writeValue(value, response);
    }
  }

