jadjer/esp32-nimble/src/Client.cpp
  NIMBLE_LOGD(LOG_TAG, "<< setValue");
  return ret;
}// setValue

/**
 * @brief Get the remote characteristic with the specified handle.
 * @param [in] handle The handle of the desired characteristic.
 * @returns The matching remote characteristic, nullptr otherwise.
 */
RemoteCharacteristic *Client::getCharacteristic(const uint16_t handle) {
  RemoteService *pService = nullptr;
  for (auto & it : m_servicesVector) {
    if (it->getStartHandle() <= handle && handle <= it->getEndHandle()) {
      pService = it;
      break;
    }
  }

  if (pService != nullptr) {
    for (auto & it : *pService) {
      if (it->getHandle() == handle) {
        return it;
      }
    }
  }

  return nullptr;
}

/**
 * @brief Get the current mtu of this connection.
 * @returns The MTU value.
 */
uint16_t Client::getMTU() {
  return ble_att_mtu(m_conn_id);
}// getMTU

/**
 * @brief Handle a received GAP event.
 * @param [in] event The event structure sent by the NimBLE stack.
 * @param [in] arg A pointer to the client instance that registered for this callback.
 */
/*STATIC*/
int Client::handleGapEvent(struct ble_gap_event *event, void *arg) {
  Client *pClient = (Client *) arg;
  int rc;

  NIMBLE_LOGD(LOG_TAG, "Got Client event %s", Utils::gapEventToString(event->type));

  switch (event->type) {

  case BLE_GAP_EVENT_DISCONNECT: {
    rc = event->disconnect.reason;
    // If Host reset tell the device now before returning to prevent
    // any errors caused by calling host functions before resyncing.
    switch (rc) {
    case BLE_HS_ECONTROLLER:
    case BLE_HS_ETIMEOUT_HCI:
    case BLE_HS_ENOTSYNCED:
    case BLE_HS_EOS:
      NIMBLE_LOGC(LOG_TAG, "Disconnect - host reset, rc=%d", rc);
      Device::onReset(rc);
      break;
    default:
      // Check that the event is for this client.
      if (pClient->m_conn_id != event->disconnect.conn.conn_handle) {
        return 0;
      }
      break;
    }

    // Stop the disconnect timer since we are now disconnected.
    ble_npl_callout_stop(&pClient->m_dcTimer);

    // Remove the device from ignore list so we will scan it again
    Device::removeIgnored(pClient->m_peerAddress);

    // No longer connected, clear the connection ID.
    pClient->m_conn_id = BLE_HS_CONN_HANDLE_NONE;

    // If we received a connected event but did not get established (no PDU)
    // then a disconnect event will be sent but we should not send it to the
    // app for processing. Instead we will ensure the task is released
    // and report the error.
    if (!pClient->m_connEstablished)
      break;

    NIMBLE_LOGI(LOG_TAG, "disconnect; reason=%d, %s",
                rc, Utils::returnCodeToString(rc));

    pClient->m_connEstablished = false;
    pClient->m_pClientCallbacks->onDisconnect(pClient, rc);
    break;
  }// BLE_GAP_EVENT_DISCONNECT

  case BLE_GAP_EVENT_CONNECT: {
    // If we aren't waiting for this connection response
    // we should drop the connection immediately.
    if (pClient->isConnected() || pClient->m_pTaskData == nullptr) {
      ble_gap_terminate(event->connect.conn_handle, BLE_ERR_REM_USER_CONN_TERM);
      return 0;
    }

    rc = event->connect.status;
    if (rc == 0) {
      NIMBLE_LOGI(LOG_TAG, "Connected event");

      pClient->m_conn_id = event->connect.conn_handle;

      rc = ble_gattc_exchange_mtu(pClient->m_conn_id, nullptr, nullptr);
      if (rc != 0) {
        NIMBLE_LOGE(LOG_TAG, "MTU exchange error; rc=%d %s",
                    rc, Utils::returnCodeToString(rc));
        break;
      }

      // In the case of a multi-connecting device we ignore this device when
      // scanning since we are already connected to it
      Device::addIgnored(pClient->m_peerAddress);
    } else {
      pClient->m_conn_id = BLE_HS_CONN_HANDLE_NONE;
      break;
    }

    return 0;
  }// BLE_GAP_EVENT_CONNECT

  case BLE_GAP_EVENT_NOTIFY_RX: {
    if (pClient->m_conn_id != event->notify_rx.conn_handle)
      return 0;

    // If a notification comes before this flag is set we might
    // access a vector while it is being cleared in connect()
    if (!pClient->m_connEstablished) {
      return 0;
    }

    NIMBLE_LOGD(LOG_TAG, "Notify Received for handle: %d",
                event->notify_rx.attr_handle);

    for (auto &it : pClient->m_servicesVector) {
      // Dont waste cycles searching services without this handle in its range
      if (it->getEndHandle() < event->notify_rx.attr_handle) {
        continue;
      }

      auto cVector = &it->m_characteristicVector;
      NIMBLE_LOGD(LOG_TAG, "checking service %s for handle: %d",
                  it->getUUID().toString().c_str(),
                  event->notify_rx.attr_handle);

      auto characteristic = cVector->cbegin();
      for (; characteristic != cVector->cend(); ++characteristic) {
        if ((*characteristic)->m_handle == event->notify_rx.attr_handle)
          break;
      }

      if (characteristic != cVector->cend()) {
        NIMBLE_LOGD(LOG_TAG, "Got Notification for characteristic %s",
                    (*characteristic)->toString().c_str());

        uint32_t data_len = OS_MBUF_PKTLEN(event->notify_rx.om);
        (*characteristic)->m_value.setValue(event->notify_rx.om->om_data, data_len);

        if ((*characteristic)->m_notifyCallback != nullptr) {
          NIMBLE_LOGD(LOG_TAG, "Invoking callback for notification on characteristic %s",
                      (*characteristic)->toString().c_str());
          (*characteristic)->m_notifyCallback(*characteristic, event->notify_rx.om->om_data, data_len, !event->notify_rx.indication);
        }
        break;
      }
    }

    return 0;
  }// BLE_GAP_EVENT_NOTIFY_RX

  case BLE_GAP_EVENT_CONN_UPDATE_REQ:
  case BLE_GAP_EVENT_L2CAP_UPDATE_REQ: {
    if (pClient->m_conn_id != event->conn_update_req.conn_handle) {
      return 0;
    }
    NIMBLE_LOGD(LOG_TAG, "Peer requesting to update connection parameters");
    NIMBLE_LOGD(LOG_TAG, "MinInterval: %d, MaxInterval: %d, Latency: %d, Timeout: %d",
                event->conn_update_req.peer_params->itvl_min,
                event->conn_update_req.peer_params->itvl_max,
                event->conn_update_req.peer_params->latency,
                event->conn_update_req.peer_params->supervision_timeout);

    rc = pClient->m_pClientCallbacks->onConnParamsUpdateRequest(pClient,
                                                                event->conn_update_req.peer_params)
        ? 0
        : BLE_ERR_CONN_PARMS;

    if (!rc && event->type == BLE_GAP_EVENT_CONN_UPDATE_REQ) {
      event->conn_update_req.self_params->itvl_min = pClient->m_pConnParams.itvl_min;
      event->conn_update_req.self_params->itvl_max = pClient->m_pConnParams.itvl_max;
      event->conn_update_req.self_params->latency = pClient->m_pConnParams.latency;
      event->conn_update_req.self_params->supervision_timeout = pClient->m_pConnParams.supervision_timeout;
    }

    NIMBLE_LOGD(LOG_TAG, "%s peer params", (rc == 0) ? "Accepted" : "Rejected");
    return rc;
  }// BLE_GAP_EVENT_CONN_UPDATE_REQ, BLE_GAP_EVENT_L2CAP_UPDATE_REQ

  case BLE_GAP_EVENT_CONN_UPDATE: {
    if (pClient->m_conn_id != event->conn_update.conn_handle) {
      return 0;
    }
    if (event->conn_update.status == 0) {
      NIMBLE_LOGI(LOG_TAG, "Connection parameters updated.");
    } else {
      NIMBLE_LOGE(LOG_TAG, "Update connection parameters failed.");
    }
    return 0;
  }// BLE_GAP_EVENT_CONN_UPDATE

  case BLE_GAP_EVENT_ENC_CHANGE: {
    if (pClient->m_conn_id != event->enc_change.conn_handle) {
      return 0;
    }

    if (event->enc_change.status == 0 || event->enc_change.status == (BLE_HS_ERR_HCI_BASE + BLE_ERR_PINKEY_MISSING)) {
      ConnectionInfo peerInfo;
      rc = ble_gap_conn_find(event->enc_change.conn_handle, &peerInfo.m_desc);
      assert(rc == 0);

      if (event->enc_change.status == (BLE_HS_ERR_HCI_BASE + BLE_ERR_PINKEY_MISSING)) {
        // Key is missing, try deleting.
        ble_store_util_delete_peer(&peerInfo.m_desc.peer_id_addr);
      } else {
        pClient->m_pClientCallbacks->onAuthenticationComplete(peerInfo);
      }
    }

    rc = event->enc_change.status;
    break;
  }//BLE_GAP_EVENT_ENC_CHANGE

