jadjer/esp32-nimble/src/Client.cpp
  case BLE_GAP_EVENT_MTU: {
    if (pClient->m_conn_id != event->mtu.conn_handle) {
      return 0;
    }
    NIMBLE_LOGI(LOG_TAG, "mtu update event; conn_handle=%d mtu=%d",
                event->mtu.conn_handle,
                event->mtu.value);
    rc = 0;
    break;
  }// BLE_GAP_EVENT_MTU

  case BLE_GAP_EVENT_PASSKEY_ACTION: {
    struct ble_sm_io pkey = {0, 0};
    (void) pkey;//warning: variable 'pkey' set but not used [-Wunused-but-set-variable]

    if (pClient->m_conn_id != event->passkey.conn_handle)
      return 0;

    if (event->passkey.params.action == BLE_SM_IOACT_DISP) {
      pkey.action = event->passkey.params.action;
      pkey.passkey = Device::m_passkey;// This is the passkey to be entered on peer
      rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      NIMBLE_LOGD(LOG_TAG, "ble_sm_inject_io result: %d", rc);

    } else if (event->passkey.params.action == BLE_SM_IOACT_NUMCMP) {
      NIMBLE_LOGD(LOG_TAG, "Passkey on device's display: %" PRIu32, event->passkey.params.numcmp);
      pkey.action = event->passkey.params.action;
      pkey.numcmp_accept = pClient->m_pClientCallbacks->onConfirmPIN(event->passkey.params.numcmp);

      rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      NIMBLE_LOGD(LOG_TAG, "ble_sm_inject_io result: %d", rc);

      //TODO: Handle out of band pairing
    } else if (event->passkey.params.action == BLE_SM_IOACT_OOB) {
      static uint8_t tem_oob[16] = {0};
      pkey.action = event->passkey.params.action;
      for (int i = 0; i < 16; i++) {
        pkey.oob[i] = tem_oob[i];
      }
      rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      NIMBLE_LOGD(LOG_TAG, "ble_sm_inject_io result: %d", rc);
      ////////
    } else if (event->passkey.params.action == BLE_SM_IOACT_INPUT) {
      NIMBLE_LOGD(LOG_TAG, "Enter the passkey");
      pkey.action = event->passkey.params.action;
      pkey.passkey = pClient->m_pClientCallbacks->onPassKeyRequest();

      rc = ble_sm_inject_io(event->passkey.conn_handle, &pkey);
      NIMBLE_LOGD(LOG_TAG, "ble_sm_inject_io result: %d", rc);

    } else if (event->passkey.params.action == BLE_SM_IOACT_NONE) {
      NIMBLE_LOGD(LOG_TAG, "No passkey action required");
    }

    return 0;
  }// BLE_GAP_EVENT_PASSKEY_ACTION

  default: {
    return 0;
  }
  }// Switch

  if (pClient->m_pTaskData != nullptr) {
    pClient->m_pTaskData->rc = rc;
    if (pClient->m_pTaskData->task) {
      xTaskNotifyGive(pClient->m_pTaskData->task);
    }
    pClient->m_pTaskData = nullptr;
  }

  return 0;
}// handleGapEvent

/**
 * @brief Are we connected to a server?
 * @return True if we are connected and false if we are not connected.
 */
bool Client::isConnected() {
  return m_conn_id != BLE_HS_CONN_HANDLE_NONE;
}// isConnected

/**
 * @brief Set the callbacks that will be invoked when events are received.
 * @param [in] pClientCallbacks A pointer to a class to receive the event callbacks.
 * @param [in] deleteCallbacks If true this will delete the callback class sent when the client is destructed.
 */
void Client::setClientCallbacks(ClientCallbacks *pClientCallbacks, bool deleteCallbacks) {
  if (pClientCallbacks != nullptr) {
    m_pClientCallbacks = pClientCallbacks;
  } else {
    m_pClientCallbacks = &defaultCallbacks;
  }
  m_deleteCallbacks = deleteCallbacks;
}// setClientCallbacks

/**
 * @brief Return a string representation of this client.
 * @return A string representation of this client.
 */
std::string Client::toString() {
  std::string res = "peer address: " + m_peerAddress.toString();
  res += "\nServices:\n";

  for (auto &it : m_servicesVector) {
    res += it->toString() + "\n";
  }

  return res;
}// toString

/**
 * @brief Get the last error code reported by the NimBLE host
 * @return int, the NimBLE error code.
 */
int Client::getLastError() {
  return m_lastErr;
}// getLastError

void ClientCallbacks::onConnect(Client *pClient) {
  NIMBLE_LOGD("NimBLEClientCallbacks", "onConnect: default");
}

void ClientCallbacks::onDisconnect(Client *pClient, int reason) {
  NIMBLE_LOGD("NimBLEClientCallbacks", "onDisconnect: default");
}

bool ClientCallbacks::onConnParamsUpdateRequest(Client *pClient, const ble_gap_upd_params *params) {
  NIMBLE_LOGD("NimBLEClientCallbacks", "onConnParamsUpdateRequest: default");
  return true;
}

uint32_t ClientCallbacks::onPassKeyRequest() {
  NIMBLE_LOGD("NimBLEClientCallbacks", "onPassKeyRequest: default: 123456");
  return 123456;
}

void ClientCallbacks::onAuthenticationComplete(ConnectionInfo &peerInfo) {
  NIMBLE_LOGD("NimBLEClientCallbacks", "onAuthenticationComplete: default");
}
bool ClientCallbacks::onConfirmPIN(uint32_t pin) {
  NIMBLE_LOGD("NimBLEClientCallbacks", "onConfirmPIN: default: true");
  return true;
}

}

#endif /* CONFIG_BT_ENABLED && CONFIG_BT_NIMBLE_ROLE_CENTRAL */
